{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv1", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leaky_conv1", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.1"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv2_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv2_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv2", 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 1], [17, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leaky_conv2", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.1"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv3_1", 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leaky_conv3_1", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.1"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv4_1", 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 1], [37, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leaky_conv4_1", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.1"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool4", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv5_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv5_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv5_1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv5_1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv5_1", 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leaky_conv5_1", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.1"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool5", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv6_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "512", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv6_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv6_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv6_1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv6_1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv6_1", 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 1], [57, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leaky_conv6_1", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.1"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool6", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv7_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv8_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv8_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "1024", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv8_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv8_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv8_1_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv8_1_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv8_1", 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leaky_conv8_1", 
      "attr": {
        "act_type": "leaky", 
        "slope": "0.1"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_pred_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "40"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_pred_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "40"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_pred", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "40"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "yolo_output_label", 
      "attr": {
        "anchors": "[1.04983694, 1.56549475, 1.07798524, 2.72911688, 1.61359259, 1.98438137, 1.6210402, 1.23622368, 1.9942962, 2.98656125]", 
        "background_grad_scale": "1.0", 
        "class_grad_scale": "1.0", 
        "coord_grad_scale": "1.0", 
        "nms_topk": "400", 
        "num_anchor": "5", 
        "num_class": "3", 
        "object_grad_scale": "5.0", 
        "warmup_samples": "12800"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "yolo_output_beta", 
      "attr": {
        "anchors": "[1.04983694, 1.56549475, 1.07798524, 2.72911688, 1.61359259, 1.98438137, 1.6210402, 1.23622368, 1.9942962, 2.98656125]", 
        "background_grad_scale": "1.0", 
        "class_grad_scale": "1.0", 
        "coord_grad_scale": "1.0", 
        "nms_topk": "400", 
        "num_anchor": "5", 
        "num_class": "3", 
        "object_grad_scale": "5.0", 
        "warmup_samples": "12800"
      }, 
      "inputs": []
    }, 
    {
      "op": "_contrib_YoloOutput", 
      "name": "yolo_output", 
      "attr": {
        "anchors": "[1.04983694, 1.56549475, 1.07798524, 2.72911688, 1.61359259, 1.98438137, 1.6210402, 1.23622368, 1.9942962, 2.98656125]", 
        "background_grad_scale": "1.0", 
        "class_grad_scale": "1.0", 
        "coord_grad_scale": "1.0", 
        "nms_topk": "400", 
        "num_anchor": "5", 
        "num_class": "3", 
        "object_grad_scale": "5.0", 
        "warmup_samples": "12800"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 1]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    11, 
    12, 
    14, 
    15, 
    16, 
    17, 
    21, 
    22, 
    24, 
    25, 
    26, 
    27, 
    31, 
    32, 
    34, 
    35, 
    36, 
    37, 
    41, 
    42, 
    44, 
    45, 
    46, 
    47, 
    51, 
    52, 
    54, 
    55, 
    56, 
    57, 
    61, 
    62, 
    64, 
    65, 
    67, 
    68, 
    69, 
    70, 
    73, 
    74, 
    76, 
    77
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    95
  ], 
  "heads": [[78, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}